[
  "dataview",
  "obsidian-kanban",
  "obsidian-tikzjax",
  "obsidian-completr",
  "pomodoro-timer",
  "obsidian-latex-suite",
  "image2latex",
  "ai-latex-generator",
  "obsidian-advanced-uri",
  "calendar",
  "obsidian-dynamic-toc",
  "obsidian-charts",
  "obsidian-columns",
  "pexels-banner",
  "obsidian-meta-bind-plugin",
  "file-explorer-plus",
  "obsidian-admonition",
  "obsidian-tasks-plugin",
  "morgen-tasks",
  "obsidian-mind-map",
  "obsidian-icon-folder"
]