[
  "dataview",
  "obsidian-kanban",
  "obsidian-tikzjax",
  "obsidian-completr",
  "obsidian-columns",
  "obsidian-icon-folder",
  "pomodoro-timer",
  "obsidian-latex-suite",
  "image2latex",
  "ai-latex-generator",
  "colored-tags",
  "obsidian-admonition",
  "obsidian-advanced-uri",
  "calendar",
  "obsidian-dynamic-toc",
  "obsidian-minimal-settings",
  "obsidian-charts",
  "obsidian-react-components",
  "obsidian-style-settings",
  "obsidian-tasks-plugin",
  "pexels-banner"
]